# getting Financial data

In [1]:
# install pandas_datareader to extraxt data from various Internet sources into dataframe

In [10]:
import pandas as pd

# package to extract data from various Internet sources into a DataFrame
# make sure you have it installed
from pandas_datareader import data, wb

# package for dates
import datetime as dt

# Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is)

In [13]:
start = dt.datetime(2015, 1, 1)
end = dt.datetime.now()

#  Select the Apple, Tesla, Twitter, IBM, LinkedIn stocks symbols and assign them to a variable called stocks

In [14]:
stocks=['AAPL','TSLA','IBM','LNKD']

# Read the data from yahoo, assign to df and print it

In [18]:
df =data.DataReader(stocks,'yahoo',start,end)

/Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages/pandas_datareader/base.py:272: SymbolWarning: Failed to read symbol: 'LNKD', replacing with NaN.
  warnings.warn(msg.format(sym), SymbolWarning)

 # What is the type of structure of df ?

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1603 entries, 2015-01-02 to 2021-05-14
Data columns (total 24 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   (Adj Close, AAPL)  1603 non-null   float64
 1   (Adj Close, TSLA)  1603 non-null   float64
 2   (Adj Close, IBM)   1603 non-null   float64
 3   (Adj Close, LNKD)  0 non-null      float64
 4   (Close, AAPL)      1603 non-null   float64
 5   (Close, TSLA)      1603 non-null   float64
 6   (Close, IBM)       1603 non-null   float64
 7   (Close, LNKD)      0 non-null      float64
 8   (High, AAPL)       1603 non-null   float64
 9   (High, TSLA)       1603 non-null   float64
 10  (High, IBM)        1603 non-null   float64
 11  (High, LNKD)       0 non-null      float64
 12  (Low, AAPL)        1603 non-null   float64
 13  (Low, TSLA)        1603 non-null   float64
 14  (Low, IBM)         1603 non-null   float64
 15  (Low, LNKD)        0 non-null      float64
 16  (Open, AAPL)       1603 non-null   float64
 17  (Open, TSLA)       1603 non-null   float64
 18  (Open, IBM)        1603 non-null   float64
 19  (Open, LNKD)       0 non-null      float64
 20  (Volume, AAPL)     1603 non-null   float64
 21  (Volume, TSLA)     1603 non-null   float64
 22  (Volume, IBM)      1603 non-null   float64
 23  (Volume, LNKD)     0 non-null      float64
dtypes: float64(24)
memory usage: 313.1 KB

# Create a dataFrame called vol, with the Volume values.

In [28]:
vol = df['Volume']
vol.head()

Symbols            AAPL        TSLA        IBM  LNKD
Date
2015-01-02  212818400.0  23822000.0  5525500.0   NaN
2015-01-05  257142000.0  26842500.0  4880400.0   NaN
2015-01-06  263188400.0  31309500.0  6146700.0   NaN
2015-01-07  160423600.0  14842000.0  4701800.0   NaN
2015-01-08  237458000.0  17212500.0  4236800.0   NaN

 # Aggregate the data of Volume to weekly

In [38]:
vol['weekly'] = vol.index.week
vol['weekly'].mean()

<ipython-input-38-1150f64aa089>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  vol['weekly'] = vol.index.week

25.80910792264504

 # Find all the volume traded in the year

In [39]:
vol['year']= vol.index.year
vol.head()

<ipython-input-39-344c54dece1d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  vol['year']= vol.index.year

Symbols            AAPL        TSLA        IBM  LNKD  year  weekly
Date
2015-01-02  212818400.0  23822000.0  5525500.0   NaN  2015       1
2015-01-05  257142000.0  26842500.0  4880400.0   NaN  2015       2
2015-01-06  263188400.0  31309500.0  6146700.0   NaN  2015       2
2015-01-07  160423600.0  14842000.0  4701800.0   NaN  2015       2
2015-01-08  237458000.0  17212500.0  4236800.0   NaN  2015       2

 # Find all the volume traded in the year 2019

In [48]:
vol_year = vol[pd.to_datetime(vol.index).year==2019]
vol_year

Symbols            AAPL        TSLA        IBM  LNKD  year  weekly
Date
2019-01-02  148158800.0  58293000.0  4239900.0   NaN  2019       1
2019-01-03  365248800.0  34826000.0  4346700.0   NaN  2019       1
2019-01-04  234428400.0  36970500.0  4477800.0   NaN  2019       1
2019-01-07  219111200.0  37756000.0  3751200.0   NaN  2019       2
2019-01-08  164101200.0  35042500.0  4763600.0   NaN  2019       2
...                 ...         ...        ...   ...   ...     ...
2019-12-24   48478800.0  40273500.0  1202100.0   NaN  2019      52
2019-12-26   93121200.0  53169500.0  2129700.0   NaN  2019      52
2019-12-27  146266000.0  49728500.0  2752200.0   NaN  2019      52
2019-12-30  144114400.0  62932000.0  4118900.0   NaN  2019       1
2019-12-31  100805600.0  51428500.0  3777500.0   NaN  2019       1

[252 rows x 6 columns]

# import the apple stock only

In [57]:
apple =data.DataReader('AAPL','yahoo',start,end)
apple.head()

                 High        Low       Open      Close       Volume  Adj Close
Date
2015-01-02  27.860001  26.837500  27.847500  27.332500  212818400.0  24.819241
2015-01-05  27.162500  26.352501  27.072500  26.562500  257142000.0  24.120045
2015-01-06  26.857500  26.157499  26.635000  26.565001  263188400.0  24.122320
2015-01-07  27.049999  26.674999  26.799999  26.937500  160423600.0  24.460564
2015-01-08  28.037500  27.174999  27.307501  27.972500  237458000.0  25.400398

 # Check out the type of the columns

In [55]:
apple.dtypes

High         float64
Low          float64
Open         float64
Close        float64
Volume       float64
Adj Close    float64
dtype: object

# set Date as columns

In [59]:
apple.reset_index(inplace=True)
apple.head()

,index,Date,High,Low,Open,Close,Volume,Adj Close
0,0,2015-01-02,27.860001,26.837500,27.847500,27.332500,212818400.0,24.819241
1,1,2015-01-05,27.162500,26.352501,27.072500,26.562500,257142000.0,24.120045
2,2,2015-01-06,26.857500,26.157499,26.635000,26.565001,263188400.0,24.122320
3,3,2015-01-07,27.049999,26.674999,26.799999,26.937500,160423600.0,24.460564
4,4,2015-01-08,28.037500,27.174999,27.307501,27.972500,237458000.0,25.400398

# Transform the Date column as a datetime type

In [60]:
apple['Date']= pd.to_datetime(apple['Date'])

# Set the date as the index

In [64]:
apple.set_index(apple['Date'])

,index,Date,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2015-01-02,0,2015-01-02,27.860001,26.837500,27.847500,27.332500,212818400.0,24.819241
2015-01-05,1,2015-01-05,27.162500,26.352501,27.072500,26.562500,257142000.0,24.120045
2015-01-06,2,2015-01-06,26.857500,26.157499,26.635000,26.565001,263188400.0,24.122320
2015-01-07,3,2015-01-07,27.049999,26.674999,26.799999,26.937500,160423600.0,24.460564
2015-01-08,4,2015-01-08,28.037500,27.174999,27.307501,27.972500,237458000.0,25.400398
...,...,...,...,...,...,...,...,...
2021-05-10,1598,2021-05-10,129.539993,126.809998,129.410004,126.849998,88071200.0,126.849998
2021-05-11,1599,2021-05-11,126.269997,122.769997,123.500000,125.910004,126142800.0,125.910004
2021-05-12,1600,2021-05-12,124.639999,122.250000,123.400002,122.769997,112172300.0,122.769997
2021-05-13,1601,2021-05-13,126.150002,124.260002,124.580002,124.970001,105861300.0,124.970001
2021-05-14,1602,2021-05-14,127.889999,125.849998,126.250000,127.449997,81806500.0,127.449997

 # Is there any duplicate dates?

In [68]:
duplicat = apple[apple.duplicated('Date')]
duplicat

Empty DataFrame
Columns: [index, Date, High, Low, Open, Close, Volume, Adj Close]
Index: []

 # Make the first entry the oldest date.

In [71]:
apple=apple.sort_values(by='Date',ascending=True)
apple.head()

,index,Date,High,Low,Open,Close,Volume,Adj Close
0,0,2015-01-02,27.860001,26.837500,27.847500,27.332500,212818400.0,24.819241
1,1,2015-01-05,27.162500,26.352501,27.072500,26.562500,257142000.0,24.120045
2,2,2015-01-06,26.857500,26.157499,26.635000,26.565001,263188400.0,24.122320
3,3,2015-01-07,27.049999,26.674999,26.799999,26.937500,160423600.0,24.460564
4,4,2015-01-08,28.037500,27.174999,27.307501,27.972500,237458000.0,25.400398

# Get the last business day of each month

In [89]:
apple['month'] = pd.DatetimeIndex(apple['Date']).month
apple['Day'] = pd.DatetimeIndex(apple['Date']).day
apple.groupby('month')['Day'].max()

month
1     31
2     29
3     31
4     30
5     31
6     30
7     31
8     31
9     30
10    31
11    30
12    31
Name: Day, dtype: int64

# What is the difference in days between the first day and the oldest

In [82]:
date_difference = apple['Date'].max()- apple['Date'].min()
date_difference

Timedelta('2324 days 00:00:00')

# How many months in the data we have?

In [87]:
apple['month'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12])

In [76]:
apple['month'] = pd.DatetimeIndex(apple['Date']).month
apple.head()

,index,Date,High,Low,Open,Close,Volume,Adj Close,month
0,0,2015-01-02,27.860001,26.837500,27.847500,27.332500,212818400.0,24.819241,1
1,1,2015-01-05,27.162500,26.352501,27.072500,26.562500,257142000.0,24.120045,1
2,2,2015-01-06,26.857500,26.157499,26.635000,26.565001,263188400.0,24.122320,1
3,3,2015-01-07,27.049999,26.674999,26.799999,26.937500,160423600.0,24.460564,1
4,4,2015-01-08,28.037500,27.174999,27.307501,27.972500,237458000.0,25.400398,1

In [79]:
total_months=apple.month.count()
total_months

1603